package Lesson3;

/*  Написать простой класс ТелефонныйСправочник, который хранит в себе список фамилий и телефонных номеров.
    В этот телефонный справочник с помощью метода add() можно добавлять записи. С помощью метода get()
    искать номер телефона по фамилии. Следует учесть, что под одной фамилией может быть несколько телефонов
    (в случае однофамильцев), тогда при запросе такой фамилии должны выводиться все телефоны.
 */

public class YellowPagesUser {
    public static void main(String[] args) {
        YellowPages.add(null, "12345");
        YellowPages.add("Batman", null);
        YellowPages.add("Петров", "9101111111");
        YellowPages.add("Петров", "910-000-12-13");
        YellowPages.get("Петров");
        YellowPages.get("Batman");
    }


}
